"""
#-------------------------------------------------------------------
#                                                           
#-------------------------------------------------------------------
#                                                                   
#                   @Project Name : python-scripts                 
#                                                                   
#                   @File Name    : Encapsulation.py                      
#                                                                   
#                   @Programmer   : tongben                          
#                                                                     
#                   @Start Date   : 2020/11/8 12:06 上午               
#                                                                   
#-------------------------------------------------------------------
#                   学习概念：类的封装
#-------------------------------------------------------------------
"""


class Cat:
    # 在Python中通过在属性名或函数名前面加上双下划线__,来对属性和方法进行访问控制。
    # 属性名或函数名加上双下划线以后，对外是不能访问的，但在类内部依然可以被访问。
    # 使用双下划线对属性和方法进行隐藏
    __species = 'Cat'

    """
    将猫抓老鼠的行为，封装为一个类方法
    所有猫都会抓老鼠
    """
    @classmethod
    def __catch(cls):
        print("A cat that doesn't catch a mouse is not a good cat!")

    def __init__(self, name):
        self.__name = name


# 以下代码执行会抛出AttributeError的属性错误异常，因为我们将属性进行了隐藏，不能再通过客户端进行访问
# Cat.__catch()
# Cat.__catch_mice()
